{
  "personalInfo": {
    "name": "Rachen Tanimkarn",
    "title": "Game Programmer driven by a passion for continuous learning and growth.",
    "description": "Welcome to my portfolio where I showcase my latest projects and development work. Explore my creations and see what I've been building.",
    "email": "Rachen.Tanimkarn@gmail.com",
    "github": "github.com/onemanking",
    "linkedin": "linkedin.com/in/rachen-tanimkarn-28222214b",
    "socialLinks": {
      "github": "https://github.com/onemanking",
      "linkedin": "https://linkedin.com/in/rachen-tanimkarn-28222214b"
    },
    "skills": ["Unity", "C#", "Node.js", "TypeScript", "React"],
    "passion": "Building amazing projects"
  },
  "about": {
    "title": "About Me",
    "paragraphs": [
      "I'm a passionate developer who loves creating innovative solutions and bringing ideas to life through code. With experience in various technologies and frameworks, I enjoy tackling challenging problems and continuously learning new skills.",
      "My focus is on creating user-friendly applications with clean, efficient code and modern design principles. I believe in the power of technology to make a positive impact and solve real-world problems."
    ],
    "skillsTitle": "Technologies I work with:"
  },
  "skills": [
    { "name": "Unity", "icon": "fab fa-unity" },
    { "name": "C#", "icon": "fas fa-code" },
    { "name": "Node.js", "icon": "fab fa-node-js" },
    { "name": "Firebase", "icon": "fas fa-fire" },
    { "name": "JavaScript", "icon": "fab fa-js-square" },
    { "name": "TypeScript", "icon": "fab fa-js-square" },
    { "name": "ElectronJs", "icon": "fas fa-desktop" },
    { "name": "React", "icon": "fab fa-react" },
    { "name": "Git", "icon": "fab fa-git-alt" }
  ],
  "contact": {
    "title": "Let's Work Together",
    "subtitle": "Have a project in mind? Let's discuss how we can bring it to life"
  },
  "footer": {
    "copyright": "2025 Rachen Tanimkarn. All rights reserved."
  },
  "projects": [
    {
      "id": 1,
      "title": "Home Sweet Home: Survive",
      "description": "A multiplayer horror game inspired by Thai mythology featuring asymmetrical gameplay. Players take on roles as either Survivors completing rituals to escape or Specters hunting them using supernatural abilities. Focuses on teamwork, strategy, and intense, unpredictable matches.",
      "image": "./assets/images/projects/hsh.jpg",
      "tags": ["Unreal", "AWS Gamelift", "BaaS", "Multiplayer", "Node.js"],
      "category": "game",
      "steamUrl": "https://store.steampowered.com/app/1056600/Home_Sweet_Home__Survive/"
    },
    {
      "id": 2,
      "title": "Make Me Up",
      "description": "An interactive in-store digital experience combining AR technology and personalized beauty consultation. Visitors receive virtual makeup try-ons, skincare analysis, and product recommendations tailored to their facial features and skin tone, enhancing customer engagement at Shiseido’s Ginza flagship store.",
      "image": "./assets/images/projects/make_me_up_0.png",
      "tags": ["Unity", "C#", "AR"],
      "category": "interactive",
      "vdoUrl": "https://www.youtube.com/shorts/_9jjbDmmVCc"
    },
    {
      "id": 3,
      "title": "Foundation Bar",
      "description": "A personalized foundation matching experience using advanced skin tone analysis technology. Customers receive tailored recommendations from a wide range of Shiseido foundation products, ensuring a perfect match in texture, shade, and finish, all delivered through an interactive and premium in-store experience.",
      "image": "./assets/images/projects/foundation_bar.jpg",
      "tags": ["Unity", "C#", "Google Vision API", "Image Processing"],
      "category": "interactive",
      "vdoUrl": "https://www.tiktok.com/@jakegalvez/video/7325274235243433221"
    },
    {
      "id": 4,
      "title": "Digiskin Tester",
      "description": "An interactive digital skincare zone where customers can explore and learn about products at their fingertips through a touchscreen interface. The DigiSkin Tester provides information based on Shiseido’s personalized skincare philosophy, focusing on protection and revitalization tailored to individual needs. It also offers self-care techniques, and users can easily save personalized recommendations by scanning a QR code with their mobile devices",
      "image": "./assets/images/projects/digiskin_tester.jpg",
      "tags": ["Unity", "C#"],
      "category": "interactive",
      "vdoUrl": "https://www.youtube.com/watch?v=Wh28jtAizaU"
    },
    {
      "id": 5,
      "title": "Lidar sensor convert into mouse input",
      "description": "A system that maps LiDAR sensor data to 2D screen space, converting hand or object positions into real-time mouse input. Designed for precise, touch-free control within the screen area, it enables cursor movement and interaction based on depth-sensing gestures detected in front of the display.",
      "image": "./assets/images/projects/lidar.jpg",
      "tags": ["Unity", "C#", "LiDAR"],
      "category": "interactive",
      "icon": "fas fa-mouse-pointer"
    },
    {
      "id": 6,
      "title": "Code Chingoo",
      "description": "An interactive drag-and-drop coding app designed for children aged 4–11. Through engaging lessons and adventures to save the Coding Islands, kids learn foundational coding skills, logic, and problem-solving. Features include a Sandbox mode for creating games and animations, a customizable home for the in-app character Miimo, and a parent dashboard to monitor progress. The app is free, ad-free, and follows international educational standards.",
      "image": "./assets/images/projects/miimo.png",
      "tags": [
        "Unity",
        "C#",
        "Firebase",
        "Node.js",
        "TypeScript",
        "Flutter",
        "ElectronJs",
        "React"
      ],
      "category": "game",
      "linkUrl": "https://codechingoo.ai/"
    },
    {
      "id": 7,
      "title": "BANCHOU TACTICS",
      "description": "Banchou Tactics is a strategy turn based role-playing game in the Japanese Gangster High School (Banchou). Game inspire by Crows (Japanese Manga) River City Ransom and Final Fantasy Tactics.",
      "image": "./assets/images/projects/banchou.jpg",
      "tags": ["Unity", "C#", "ECS"],
      "category": "game",
      "steamUrl": "https://store.steampowered.com/app/1981160/BANCHOU_TACTICS/"
    },
    {
      "id": 8,
      "title": "More Projects",
      "description": "Explore more of my projects on GitHub, where I share my latest work and contributions to various open-source initiatives. Check out my repositories for code samples, project documentation, and more.",
      "tags": ["GitHub", "Open Source"],
      "category": "web",
      "githubUrl": "https://github.com/onemanking?tab=repositories&q=&type=source&language=&sort=",
      "icon": "fab fa-github"
    }
  ]
}
